tuminh21/device_nrf52840/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/test - Copy/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

#define PDM_BUFFER_BLOCK_NUM (6)
#define PDM_BUFFER_BLOCK_LENGTH (16000)

nrfx_pdm_config_t pdm_for_test = NRFX_PDM_DEFAULT_CONFIG(27,26);

int8_t pdm_buffer[PDM_BUFFER_BLOCK_NUM][PDM_BUFFER_BLOCK_LENGTH];
uint8_t buffer_ptr = 0;
bool full_flag = false;
int count=0;

void pdm_buffer_handler(nrfx_pdm_evt_t const * const p_evt)
{
  
	//printf("Buffer Start !!\n");
        if(p_evt->buffer_requested == true)
	{
                if (count==5){
                  full_flag = true;
                 }

                if(full_flag)
                {
                   nrfx_pdm_buffer_set(&pdm_buffer[5][0], PDM_BUFFER_BLOCK_LENGTH);
                   printf("pending \n");
                }
                else
                {
                  nrfx_pdm_buffer_set(&pdm_buffer[buffer_ptr][0], PDM_BUFFER_BLOCK_LENGTH);
		  buffer_ptr = count;
                  count++;
                  printf("%d \n", count);
                  
                }

	}

	if(p_evt->error != NRFX_PDM_NO_ERROR)
	{ 
		bsp_board_led_invert(0);
                nrfx_pdm_buffer_set(&pdm_buffer[5][0], PDM_BUFFER_BLOCK_LENGTH);
                printf("pending again \n");
	}
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();	
    nrfx_pdm_init(&pdm_for_test, pdm_buffer_handler);	
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

/********************  *******************************/


		
    nrfx_pdm_start();	
/*
    int x = 0;
    int y = 0;
    for(int x = 0; x < 5; x++)
    {
      for(int y = 0; y < 16000; y++)
      {
        pdm_buffer[x][y] = y;
      }
    }
    int lg = 100;
    uint32_t       err_code;
    int array[100];

    for (;;)
    {
        
        srand(time(NULL));
        for (int i = 0; i < 100; i++) {
            array[i] = rand() % i;
        }
        for (int i = 0; i < 100; i++) {
          printf("%d ", array[i]);
         }
        printf("\n");
        err_code = ble_nus_data_send(&m_nus, array, &lg, m_conn_handle);
        nrf_delay_ms(100);



    }
 
*/
    // Enter main loop.
    uint32_t       err_code;
    int lg = 200;
    for (;;)
    {
       idle_state_handle();


        if (count==5 && full_flag==true)
        {
          //nrfx_pdm_stop();
          for(int i=0; i<5; i++){
            for(int j=0; j<160; j++){
               //printf("%d  %d : %d \n",i, j, pdm_buffer[i][j]);
               err_code = ble_nus_data_send(&m_nus, pdm_buffer, &lg, m_conn_handle);
               nrf_delay_ms(100);
            
            }
          }
          count = 0;
          full_flag = false;
          printf("Buffer Done !!");
       }
        	

    }

}


/**
 * @}
 */